In [2]:
import pandas as pd

In [6]:
df = pd.read_csv("US_Baby_Names_right.csv") #czytanie pliku csv

In [29]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [34]:
df2 = pd.DataFrame({
    'Kategoria': ['A', 'B', 'A', 'B'],
    'Wartość': [10, 20, 30, 40]
})
print(df2.groupby('Kategoria').sum())

           Wartość
Kategoria
A               40
B               60

In [62]:
x = df.groupby('Name').sum().sort_values(by='Count',ascending = False)  # grupowanie i sumowanie wierszy i sortowanie

In [63]:
y = pd.DataFrame(x['Count'])
y

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

In [80]:
y = pd.DataFrame({
    'Kolumna 1' : ['A','B','C'],
    'Kolumna 2' : [1,2,3]
}).set_index(['Kolumna 1','Kolumna 2']) # ustawianie indeksów

y.reset_index() # resetowanie ustawien

  Kolumna 1  Kolumna 2
0         A          1
1         B          2
2         C          3

In [82]:
print("Column-wise creation:")
display(pd.DataFrame.from_dict(
    {"col_1": [3, 2, 1, 0], "col_2": ["a", "b", "c", "d"]}
))

print("Row-wise creation:")
display(pd.DataFrame.from_dict(
    {"row_1": [3, 2, 1, 0], "row_2": ["a", "b", "c", "d"]}, orient="index"
))

Column-wise creation:

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

Row-wise creation:

       0  1  2  3
row_1  3  2  1  0
row_2  a  b  c  d

In [99]:
# obracanie data frame

df = pd.DataFrame({
    'Kolumna1': [1, 2, 3],
    'Kolumna2': ['a', 'b', 'c']
})

# Transpozycja DataFrame
df_transponowane = df.T

print(df_transponowane)
print(df_transponowane.dtypes)
a = 5
type(a)
type(df_transponowane)

          0  1  2
Kolumna1  1  2  3
Kolumna2  a  b  c
0    object
1    object
2    object
dtype: object

pandas.core.frame.DataFrame

In [100]:
df = pd.read_csv("US_Baby_Names_right.csv") #czytanie pliku csv

In [108]:
df[['Count','Name']]

         Count     Name
0           62     Emma
1           48  Madison
2           46   Hannah
3           44    Grace
4           41    Emily
...        ...      ...
1016390      5     Seth
1016391      5  Spencer
1016392      5     Tyce
1016393      5   Victor
1016394      5   Waylon

[1016395 rows x 2 columns]

In [109]:
series = df['Count'] # Series

In [113]:
display(pd.DataFrame(series.sample(10)))

        Count
198555      8
635429      8
135936      5
367285      6
822201     15
698150     35
56468      72
385013     12
895755     99
571080     58

In [115]:
a = series.sample(10)
a

227620    22
755071    71
378111    29
104623    26
337411     6
26804     11
193147    19
496164    16
986596    25
644636    15
Name: Count, dtype: int64

In [116]:
a/5

227620     4.4
755071    14.2
378111     5.8
104623     5.2
337411     1.2
26804      2.2
193147     3.8
496164     3.2
986596     5.0
644636     3.0
Name: Count, dtype: float64

In [118]:
pd.to_datetime(a)

227620   1970-01-01 00:00:00.000000022
755071   1970-01-01 00:00:00.000000071
378111   1970-01-01 00:00:00.000000029
104623   1970-01-01 00:00:00.000000026
337411   1970-01-01 00:00:00.000000006
26804    1970-01-01 00:00:00.000000011
193147   1970-01-01 00:00:00.000000019
496164   1970-01-01 00:00:00.000000016
986596   1970-01-01 00:00:00.000000025
644636   1970-01-01 00:00:00.000000015
Name: Count, dtype: datetime64[ns]

In [119]:
a

227620    22
755071    71
378111    29
104623    26
337411     6
26804     11
193147    19
496164    16
986596    25
644636    15
Name: Count, dtype: int64

In [120]:
a.values

array([22, 71, 29, 26,  6, 11, 19, 16, 25, 15], dtype=int64)

In [121]:
a.index

Index([227620, 755071, 378111, 104623, 337411, 26804, 193147, 496164, 986596,
       644636],
      dtype='int64')

In [130]:
import numpy as np
display(pd.Series(np.random.randn(5), index = ['a', 'b', 'c', 'i','e']))

a   -1.867876
b   -1.004466
c    0.832443
i    0.403012
e    0.158843
dtype: float64

In [135]:
# Broadcasting jest też w Pandasie
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])

display(pd.DataFrame(s, columns=["Original Series"]))

    Original Series
49              NaN
48              NaN
47              NaN
46              NaN
45              NaN
1               NaN
2               NaN
3               NaN
4               NaN
5               NaN

In [148]:
display(pd.DataFrame(s.iloc[:4:-1], columns=["Sliced with iloc"]))

   Sliced with iloc
5               NaN
4               NaN
3               NaN
2               NaN
1               NaN

In [147]:
display(pd.DataFrame(s.loc[:], columns=["Sliced with loc"]))

    Sliced with loc
49              NaN
48              NaN
47              NaN
46              NaN
45              NaN
1               NaN
2               NaN
3               NaN
4               NaN
5               NaN

In [177]:
data= np.array([[ 5.8,2.8], [ 6.0,2.2]])
dataset = pd.DataFrame({'A': data[:,0], 'B': data[:,1]})
print(dataset)
print(dataset.iat[1, 0]) # dostęp do wartosci pojedynczej komówki w DaraFrame
print(dataset.at[0,'A'])
dataset.iloc[0:1,0:2]>10
dataset.iloc[0:1,] # dostęp do całych wierszy,kolumn indeksowanie jak w NumPy
dataset.iat[0,0]=10 # możemy normalnie zmieniać wartość
dataset

     A    B
0  5.8  2.8
1  6.0  2.2
6.0
5.8

      A    B
0  10.0  2.8
1   6.0  2.2

In [179]:
left_frame = pd.DataFrame({"key": range(5), "left_value": ["a", "b", "c", "d", "e"]})
right_frame = pd.DataFrame({"key": range(2, 7), "right_value": ["f", "g", "h", "i", "j"]})
display(pd.merge(left_frame, right_frame, on='key', how='left')) # używa kluczy tylko z lewej ramki
# on='key' oznacza, że łączenie ma odbywać się na podstawie kolumny key.
display(left_frame)
display(right_frame)

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e

   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

In [188]:
xd = left_frame.groupby('key')
for x,s in xd :
    print(x,s)
xd.first()
xd.last()

0    key left_value
0    0          a
1    key left_value
1    1          b
2    key left_value
2    2          c
3    key left_value
3    3          d
4    key left_value
4    4          e

    left_value
key
0            a
1            b
2            c
3            d
4            e

In [196]:
import pandas as pd
import numpy as np

# Tworzenie przykładowego DataFrame
df = pd.DataFrame({
    'city': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'Chicago', 'New York'],
    'population': [8419000, 3980400, 8419000, 2716000, 3980400, 2716000, 8419000],
    'area': [783.8, 1213.9, 783.8, 606.1, 1213.9, 606.1, 783.8]
})

# Grupowanie danych na podstawie miasta
grouped = df.groupby("city")

# Użycie agg do obliczenia sumy, średniej i odchylenia standardowego dla wybranych kolumn
stats = grouped['population'].agg([np.sum, np.mean, np.std])
stats

C:\Users\szwar\AppData\Local\Temp\ipykernel_1716\294674095.py:15: FutureWarning: The provided callable <function sum at 0x000001E7FF3A0540> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  stats = grouped['population'].agg([np.sum, np.mean, np.std])
C:\Users\szwar\AppData\Local\Temp\ipykernel_1716\294674095.py:15: FutureWarning: The provided callable <function mean at 0x000001E7FF3A1620> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  stats = grouped['population'].agg([np.sum, np.mean, np.std])
C:\Users\szwar\AppData\Local\Temp\ipykernel_1716\294674095.py:15: FutureWarning: The provided callable <function std at 0x000001E7FF3A1760> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  stats = grouped['population'].agg([np.sum, np.mean, np.std])

                  sum       mean  std
city
Chicago       5432000  2716000.0  0.0
Los Angeles   7960800  3980400.0  0.0
New York     25257000  8419000.0  0.0